china-djyos/djyos/bsp/cpudrv/stm32/f7/src/lcd/cpu_peri_lcd.c
//----------------------------------------------------
// Copyright (c) 2018, Djyos Open source Development team. All rights reserved.
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:

// 1. Redistributions of source code must retain the above copyright notice,
//    this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.

// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//-----------------------------------------------------------------------------
// Copyright (c) 2018，著作权由都江堰操作系统开源开发团队所有。著作权人保留一切权利。
//
// 这份授权条款，在使用者符合下列条件的情形下，授予使用者使用及再散播本
// 软件包装原始码及二进位可执行形式的权利，无论此包装是否经改作皆然：
//
// 1. 对于本软件源代码的再散播，必须保留上述的版权宣告、本条件列表，以
//    及下述的免责声明。
// 2. 对于本套件二进位可执行形式的再散播，必须连带以文件以及／或者其他附
//    于散播包装中的媒介方式，重制上述之版权宣告、本条件列表，以及下述
//    的免责声明。

// 免责声明：本软件是本软件版权持有人以及贡献者以现状（"as is"）提供，
// 本软件包装不负任何明示或默示之担保责任，包括但不限于就适售性以及特定目
// 的的适用性为默示性担保。版权持有人及本软件之贡献者，无论任何条件、
// 无论成因或任何责任主义、无论此责任为因合约关系、无过失责任主义或因非违
// 约之侵权（包括过失或其他原因等）而起，对于任何因使用本软件包装所产生的
// 任何直接性、间接性、偶发性、特殊性、惩罚性或任何结果的损害（包括但不限
// 于替代商品或劳务之购用、使用损失、资料损失、利益损失、业务中断等等），
// 不负任何责任，即在该种使用已获事前告知可能会造成此类损害的情形下亦然。
//-----------------------------------------------------------------------------
#include "cpu_peri.h"
#include "djyos.h"
#include "stdlib.h"
#include "stm32f7xx.h"
#include "stm32f7xx_hal_dma2d.h"
#include "stm32f7xx_hal_ltdc.h"
#include "stm32f7xx_hal_rcc_ex.h"
#include "cpu_peri_lcd.h"
#include "string.h"

#include "project_config.h"     //本文件由IDE中配置界面生成，存放在APP的工程目录中。
                                //允许是个空文件，所有配置将按默认值配置。
//@#$%component configure   ****组件配置开始，用于 DIDE 中图形化配置界面
//****配置块的语法和使用方法，参见源码根目录下的文件：component_config_readme.txt****
//%$#@initcode      ****初始化代码开始，由 DIDE 删除“//”后copy到初始化文件中
//  extern struct DisplayObj* ModuleInstall_LCD(const char *DisplayName,const char* HeapName);
//  ModuleInstall_LCD(CFG_ONCHIP_DISPLAY_NAME,CFG_ONCHIP_LCD_HEAP_NAME);
//%$#@end initcode  ****初始化代码结束

//%$#@describe      ****组件描述开始
//component name:"cpu onchip lcd"//CPU内置LCD控制器驱动
//parent:"graphical kernel"   //填写该组件的父组件名字，none表示没有父组件
//attribute:bsp                 //选填“third、system、bsp、user”，本属性用于在IDE中分组
//select:choosable              //选填“required、choosable、none”，若填必选且需要配置参数，则IDE裁剪界面中默认勾取，
                                //不可取消，必选且不需要配置参数的，或是不可选的，IDE裁剪界面中不显示，
//init time:medium              //初始化时机，可选值：early，medium，later, pre-main。
                                //表示初始化时间，分别是早期、中期、后期
//dependence:"heap","graphical kernel"//该组件的依赖组件名（可以是none，表示无依赖组件），
                                //选中该组件时，被依赖组件将强制选中，
                                //如果依赖多个组件，则依次列出
//weakdependence:none           //该组件的弱依赖组件名（可以是none，表示无依赖组件），
                                //选中该组件时，被依赖组件不会被强制选中，
                                //如果依赖多个组件，则依次列出，用“,”分隔
//mutex:"none"                  //该组件的互斥组件名（可以是none，表示无互斥组件），
                                //如果与多个组件互斥，则依次列出
//%$#@end describe  ****组件描述结束

//%$#@configue      ****参数配置开始
#if ( CFG_MODULE_ENABLE_CPU_ONCHIP_LCD == false )
//#warning  " cpu_onchip_lcd  组件参数未配置，使用默认配置"
//%$#@target = header   //header = 生成头文件,cmdline = 命令行变量，DJYOS自有模块禁用
#define CFG_MODULE_ENABLE_CPU_ONCHIP_LCD    false //如果勾选了本组件，将由DIDE在project_config.h或命令行中定义为true
//%$#@num,1,2048,
#define CFG_LCD_XSIZE                   600 //"LCD水平像素宽度",
#define CFG_LCD_YSIZE                   480 //"LCD竖直像素宽度",
//%$#@num,,,
#define CFG_LCD_XSIZE_UM   36720            //"LCD宽度-微米数",
#define CFG_LCD_YSIZE_UM   48960            //"LCD高度-微米数",
//%$#@enum,true,false,
//%$#@string,1,32,
#define CFG_ONCHIP_DISPLAY_NAME        "LCD_F7"    //"显示器LCD名称",
#define CFG_ONCHIP_LCD_HEAP_NAME       "extram"    //"LCD使用堆名称",
//%$#select,        ***从列出的选项中选择若干个定义成宏
//%$#@free,
#endif
//%$#@end configue  ****参数配置结束
//%$#@exclude       ****编译排除文件列表
//%$#@end exclude   ****组件描述结束
//@#$%component end configure


#define lcd_swap(a, b){a^=b; b^=a; a^=b;}

static struct LCD_ConFig lcd;                      //管理LCD LTDC的重要参数
static LTDC_HandleTypeDef  LTDC_Handler;       //LTDC句柄
static u8 *pLTDCBufferFG1 =NULL;//缓冲区起始位置
//static u8 *pLTDCBufferFG2 =NULL;//缓冲区起始位置
static struct DisplayObj lcd_display;
static struct MutexLCB Dma2dMutex;//Dma2D互斥访问。

//不同的屏有些参数是不同的，不同那个的屏需要实现该函，数完成该函数参数的配置
extern bool_t Ltdc_Lcd_Config(struct LCD_ConFig *lcd);
//----------------------------------------------------------------
//功能: 开关背光
//参数:  0关背光 非零开背光
//----------------------------------------------------------------
__attribute__((weak))   void Lcd_BackLight_OnOff(u8 onoff)
{
//  if(onoff)
//      GPIO_SettoLow(GPIO_A,PIN8);
//  else
//      GPIO_SettoHigh(GPIO_A,PIN8);
}

//----------------------------------------------------------------
//功能: 开关LTDC
//参数:0/1
//----------------------------------------------------------------------------
void LTDC_Switch(u8 sw)
{
    if(sw==1) __HAL_LTDC_ENABLE(&LTDC_Handler);
    else if(sw==0)__HAL_LTDC_DISABLE(&LTDC_Handler);
}

//----------------------------------------------------------------
//功能: 开关指定层Layer
//参数:  层layer 0,第一层; 1,第二层
//      开关sw 1/0
//返回值:ture/false
//----------------------------------------------------------------------------
bool_t LTDC_Layer_Switch(u8 layerx,u8 sw)
{
    if(sw==1) __HAL_LTDC_LAYER_ENABLE(&LTDC_Handler,layerx);
    else if(sw==0) __HAL_LTDC_LAYER_DISABLE(&LTDC_Handler,layerx);
    __HAL_LTDC_RELOAD_CONFIG(&LTDC_Handler);
    return true;
}

//----------------------------------------------------------------
//功能: LTDC时钟设置。
//参数: pllsaidivr:LCD时钟分频系数,取值范围:0~3,对应分频2^(pllsaidivr+1)
//返回值:0,成功;1,失败。
//备注:CLK=(pllsain/pllsair)/(pllsaidivr)
//----------------------------------------------------------------------------
static bool_t LTDC_Clk_Set(u32 pllsain,u32 pllsair,u32 pllsaidivr)
{
    RCC_PeriphCLKInitTypeDef PeriphClkIniture;

    //LTDC输出像素时钟，需要根据自己所使用的LCD数据手册来配置！
    PeriphClkIniture.PeriphClockSelection=RCC_PERIPHCLK_LTDC;   //LTDC时钟
    PeriphClkIniture.PLLSAI.PLLSAIN=pllsain;
    PeriphClkIniture.PLLSAI.PLLSAIR=pllsair;
    PeriphClkIniture.PLLSAIDivR=pllsaidivr;

    if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkIniture)==HAL_OK)
    {
        return 0;   //成功
    }
    else return 1;  //失败
}

//----初始化DMA2D硬件------------------------------------------------------------
//功能: 初始化DMA2D硬件
//参数: 无
//返回: 无
//备注:
//----------------------------------------------------------------------------
static bool_t Dma2d_Init(void)
{
    __HAL_RCC_DMA2D_CLK_ENABLE();               //使能DMA2D时钟

