china-djyos/djyos/bsp/cpudrv/stm32/f7/src/lcd/cpu_peri_lcd.c
bool_t __lcd_blt_bm_to_bm(struct RectBitmap *dst_bitmap,
                          struct Rectangle *DstRect,
                          struct RectBitmap *src_bitmap,
                          struct Rectangle *SrcRect,
                          struct RopGroup RopCode,u32 transparentcolor)
{

    u16 *src_offset,*dst_offset;    //源位图点阵缓冲区可能不对齐!!!
    u32 width,height,y;
    u32 timeout=0;
    bool_t flag=true;
    struct RopGroup Rop = { 0, 0, 0, CN_R2_COPYPEN, 0, 0, 0  };

    width = SrcRect->right-SrcRect->left;
    height= SrcRect->bottom-SrcRect->top;

    if((dst_bitmap->PixelFormat != lcd.LcdPixelFormat) \
             ||(src_bitmap->PixelFormat != lcd.LcdPixelFormat)\
             ||((DstRect->bottom-DstRect->top) != height)\
             ||((DstRect->right-DstRect->left) != width)\
             ||(memcmp(&RopCode, &Rop ,sizeof(struct RopGroup))!=0)
             ||((ptu32_t)src_bitmap->bm_bits & 1))
        return false;

    src_offset = (u16*)((ptu32_t)(src_bitmap->bm_bits+\
              SrcRect->top * src_bitmap->linebytes)+\
              SrcRect->left*lcd.pixsize);

    dst_offset = (u16*)((ptu32_t)(dst_bitmap->bm_bits+\
             DstRect->top * dst_bitmap->linebytes)+\
             DstRect->left*lcd.pixsize);
//    dst_offset -= 0x22;   显示全屏图片的时候，会有点偏差，加上这个就没有偏差了。
    if(false==Lock_MutexPend(&Dma2dMutex,lcd.Dma2dTimeOut))
        return false;
    DMA2D->CR=0<<16;                //存储器到存储器模式
    DMA2D->FGPFCCR=lcd.Dma2dPixelFormat;   //设置颜色格式
    DMA2D->FGOR=(u32)(src_bitmap->width - width); //前景层行偏移为0
    DMA2D->OOR= (u32)(dst_bitmap->width - width); //设置行偏移
    DMA2D->CR&=~(1<<0);                 //先停止DMA2D
    if(src_bitmap->reversal == false)
    {
        DMA2D->FGMAR=(u32)src_offset;       //源地址
        DMA2D->OMAR=(u32)dst_offset;        //输出存储器地址
        DMA2D->NLR=(height)|((width)<<16);   //设定行数寄存器
        DMA2D->CR|=1<<0;                //启动DMA2D
        while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
        {
            timeout++;
            if(timeout>0X1FFFFF)
            {
                flag=false;
                break;  //超时退出
            }
        }
        DMA2D->IFCR|=1<<1;              //清除传输完成标志
    }
    else
    {
        src_offset = (u16*)((ptu32_t)src_bitmap->bm_bits
            +(src_bitmap->height - SrcRect->top-1) * src_bitmap->linebytes);
        src_offset += SrcRect->left;
        for(y = DstRect->top; y < DstRect->bottom; y++)
        {
            DMA2D->FGMAR=(u32)src_offset;       //源地址
            DMA2D->OMAR=(u32)dst_offset;        //输出存储器地址
            DMA2D->NLR=(1)|((width)<<16);   //设定行数寄存器
            DMA2D->CR|=1<<0;                //启动DMA2D
            while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
            {
                timeout++;
                if(timeout>0X1FFFFF)
                {
                    flag=false;
                    break;  //超时退出
                }
            }
            DMA2D->IFCR|=1<<1;              //清除传输完成标志
            dst_offset += dst_bitmap->linebytes >> 1;
            src_offset -= src_bitmap->linebytes >> 1;
        }

    }
    Lock_MutexPost(&Dma2dMutex);
    return flag;
}

//----screen中画像素-----------------------------------------------------------
//功能: 在screen中画一个像素.
//参数: x、y，像素坐标
//      color，颜色
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=没有绘制，或无需绘制
//-----------------------------------------------------------------------------
bool_t __lcd_set_pixel_screen(s32 x,s32 y,u32 color,u32 rop2_code)
{

    u32 dest;
    u32 byteoffset;
    if(((x+1)>CFG_LCD_XSIZE)||((y+1)>CFG_LCD_YSIZE))
        return false;
    byteoffset = (y*CFG_LCD_XSIZE + x)*lcd.pixsize;
    color = GK_ConvertRGB24ToPF(lcd.LcdPixelFormat,color);
    dest = (u32)lcd.pFrameBuffe[byteoffset];
    dest = GK_BlendRop2(dest,color,rop2_code);

    switch (lcd.pixsize)
    {
    case 2:
        *(u16 *)(&lcd.pFrameBuffe[byteoffset]) = (u16)color;
        break;
    case 3:
        lcd.pFrameBuffe[byteoffset] = (u8)color>>16;
        lcd.pFrameBuffe[byteoffset+1] = (u8)color>>8;
        lcd.pFrameBuffe[byteoffset+2] = (u8)color;
        break;
    default:            break;
    }
    return true;

}

//在screen中画一个像素，有frame buffer的情况下，正常显示gui不会调用这个函数，
//如果窗口direct_screen==true，则可能调用本函数，无论是否有frame buffer，
//driver都必须提供并且必须实现本函数
//镜像显示器必须实现本函数的功能,不能直接返回false
//参数:
// PixelGroup: 像素坐标数组指针.
// color: 颜色值,CN_SYS_PF_ERGB8888格式
// n: 坐标点的数量
// r2_code: 显示效果,详见gkernel.h中的CN_R2_BLACK族常数定义
bool_t __lcd_set_pixel_group_screen(struct PointCdn *PixelGroup,u32 color,u32 n, u32 r2_code)
{
    u32 dest,i;
    u32 offset;
    color = GK_ConvertRGB24ToPF(lcd.LcdPixelFormat,color);

    for(i=0;i<n;i++)
    {
        offset = PixelGroup[i].y*CFG_LCD_XSIZE + PixelGroup[i].x;
        dest = *(u16 *)&(lcd.pFrameBuffe[offset]);
        dest = GK_BlendRop2(dest,color,r2_code);

        *(u16 *)&(lcd.pFrameBuffe[offset]) = dest;
    }


    return true;
}

//----screen中画线---------------------------------------------------------------
//功能: 在screen中画一条任意直线，不含端点，只绘制在limit限定的区域内的部分。如
//      不支持画线的硬件加速，直接返回false。
//参数: limit，限制矩形，只绘制在该矩形内部的部分
//      x1、y1、x2、y2，起点终点坐标
//      color，绘图用的颜色
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=失败，无硬件加速或不支持按r2_code画线
//-----------------------------------------------------------------------------
bool_t __lcd_line_screen(struct Rectangle *limit,
                    s32 x1,s32 y1,s32 x2,s32 y2,u32 color,u32 r2_code)
{
    if(y1 == y2)    //绘水平线
    {
        if(x1 > x2)
            lcd_swap(x1,x2);
        if((y1 < limit->top) || (y1 >= limit->bottom)
            ||(x2 <= limit->left) || (x1 >= limit->right))
            return false;         //所绘直线在limit之外
        if(x1 < limit->left)
            x1 = limit->left;
        if(x2 > limit->right)
            x2 = limit->right;
        color = GK_ConvertRGB24ToPF(lcd.LcdPixelFormat,color);
        return LTDC_Color_Fill( x1,y1,x2-1,y2+1,color);

    }else if(x1 == x2)   //绘垂直线
    {
        if(y1 > y2)
            lcd_swap(y1,y2);
        if((x1 < limit->left) || (x1 >= limit->right)
            ||(y2 <= limit->top) || (y1 >= limit->bottom))
            return false;         //所绘直线在limit之外
        if(y1 < limit->top)
            y1 = limit->top;
        if(y2 > limit->bottom)
            y2 = limit->bottom;
        color = GK_ConvertRGB24ToPF(lcd.LcdPixelFormat,color);
        return LTDC_Color_Fill( x1,y1,x2+1,y2-1,color);
    }
    return false;
}
//----screen中画线(含端点)------------------------------------------------------
//功能: 在screen中画一条直线，只绘制在limit限定的区域内的部分。
//参数: limit，限制矩形，只绘制在该矩形内部的部分
//      x1、y1、x2、y2，起点终点坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=失败，无硬件加速或不支持按r2_code画线
//-----------------------------------------------------------------------------
static bool_t __lcd_line_screen_ie(struct Rectangle *limit,
                        s32 x1,s32 y1,s32 x2,s32 y2,u32 color,u32 r2_code)
{

