china-djyos/djyos/bsp/cpudrv/stm32/f7/src/lcd/cpu_peri_lcd.c
    return false;
}
//----screen中填充矩形-----------------------------------------------------------
//功能: 把screen中的矩形用color颜色填充，color的格式是cn_sys_pf_e8r8g8b8。
//参数: dst_rect，待填充的矩形
//      color，填充颜色
//返回: true=成功绘制，false=失败
//-----------------------------------------------------------------------------
bool_t __lcd_fill_rect_screen(struct Rectangle *Target,
                              struct Rectangle *Focus,
                              u32 Color0,u32 Color1,u32 Mode)
{
    u32 pen;
    bool_t flag;
    if(Mode != CN_FILLRECT_MODE_N)
        return false;
    pen = GK_ConvertRGB24ToPF(lcd.LcdPixelFormat,Color0);
    flag=LTDC_Color_Fill(Focus->left,Focus->top,Focus->right-1,Focus->bottom-1,pen);
    return flag;
}

//----bitmap到screen位块传送---------------------------------------------------
//功能: 把一个位图中的一个矩形区域传送到另一个区域，
//      源和目的位图可以相同。
//参数: dst_rect，目标矩形
//      src_bitmap，源位图
//      xsrc、ysrc，源位图中被传送的区域左上角坐标(以源位图左上角坐标为原点)
//返回: true=成功，false=失败
//-----------------------------------------------------------------------------
static bool_t __lcd_bm_to_screen(struct Rectangle *dst_rect,
        struct RectBitmap *src_bitmap,s32 x,s32 y)
{

    u32 width,height;
    u32 pixel,use=0,linelen;
    u32 j,timeout=0;;
    u16 *line;
    u8 x0,x1;
    bool_t flag=true;
    u32 addr;

    width = dst_rect->right-dst_rect->left;
    height = dst_rect->bottom-dst_rect->top;
//    LTDC_Layer_Window_Config(0,x,y,width,height);

    addr=((u32)lcd.pFrameBuffe+lcd.pixsize*(CFG_LCD_XSIZE*y+x));

    if(false==Lock_MutexPend(&Dma2dMutex,lcd.Dma2dTimeOut))
        return false;
    DMA2D->CR=0<<16;                //存储器到存储器模式
    DMA2D->FGPFCCR=lcd.Dma2dPixelFormat;   //设置颜色格式
    DMA2D->FGOR=(u32)(src_bitmap->width - width); //前景层行偏移为0
    DMA2D->OOR= (u32)(src_bitmap->height - height); //设置行偏移
    DMA2D->CR&=~(1<<0);             //先停止DMA2D
    DMA2D->FGMAR=(u32)src_bitmap->bm_bits;        //源地址
    DMA2D->OMAR=(u32)addr;        //输出存储器地址
    DMA2D->NLR=(height)|((width)<<16);   //设定行数寄存器
    DMA2D->CR|=1<<0;                //启动DMA2D
    while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
    {
        timeout++;
        if(timeout>0X1FFFFF)
        {
            flag=false;
            break;  //超时退出
        }
    }
    DMA2D->IFCR|=1<<1;              //清除传输完成标志
    Lock_MutexPost(&Dma2dMutex);


//    linelen = src_bitmap->linebytes;
//    line = (u16*)(src_bitmap->bm_bits + ysrc*linelen + xsrc*2);
//    for(y = 0;y < height;y++)
//    {
//        WriteDataBytes(line,width*2);
//        line += linelen/2;
//    }
    return flag;
}
//----从screen中取像素---------------------------------------------------------
//功能: 从screen中取一像素，并转换成cn_sys_pf_e8r8g8b8或cn_sys_pf_a8r8g8b8格式。
//参数: x、y，坐标
//返回: 像素颜色值
//-----------------------------------------------------------------------------
u32 __lcd_get_pixel_screen(s32 x,s32 y)
{
    u32 e,r,g,b,color;
    u32 byteoffset;
    byteoffset = (y*CFG_LCD_XSIZE + x)*lcd.pixsize;

    switch (lcd.pixsize)
    {
    case 2:
        color = *(u16 *)(&lcd.pFrameBuffe[byteoffset]);
        r = (color>>11) &0x1f;
        g = (color>>5) & 0x3f;
        b = color & 0x1f;
        break;
    case 3:
        color = lcd.pFrameBuffe[byteoffset]|\
        lcd.pFrameBuffe[byteoffset+1] <<8|\
        lcd.pFrameBuffe[byteoffset+2] <<16;
        b = lcd.pFrameBuffe[byteoffset];
        g = lcd.pFrameBuffe[byteoffset+1];
        r = lcd.pFrameBuffe[byteoffset+2];
        break;
    default:            break;
    }
    e = 0;
    return ((e<<28)|(r<<20) | (g<<12) | (b<<4));
}

//----读取bitmap中矩形块-------------------------------------------------------
//功能: 把一个位图中的矩形读取到另一个位图中。
//参数: rect，欲读取的矩形
//      dest，保存矩形的位图，其长宽必须与rect相同
//返回: true=成功读取，false=失败，原因可能是提供了不支持的像素格式
//-----------------------------------------------------------------------------
static bool_t __lcd_get_rect_screen(struct Rectangle *rect,struct RectBitmap *dest)
{
    return false;
}

//----初始化lcd设备------------------------------------------------------------
//功能: 初始化lcd设备。
//参数: 无
//返回: 显示器资源指针
//-----------------------------------------------------------------------------
struct DisplayObj* ModuleInstall_LCD(const char *DisplayName,\
        const char* HeapName)
{
    static struct GkWinObj frame_win;
    static struct RectBitmap FrameBitmap;

    struct HeapCB *heap;
    Ltdc_Lcd_Config(&lcd);
    heap =Heap_FindHeap(HeapName);
    if(heap==NULL)
        return NULL;
    //多申请64字节如果显存不是64字节对齐描点的时候会有闪屏的现象
    pLTDCBufferFG1 =M_MallocHeap(CFG_LCD_XSIZE*CFG_LCD_YSIZE*lcd.pixsize+0x40,heap,0);
//    pLTDCBufferFG2 =M_MallocHeap(CFG_LCD_XSIZE*CFG_LCD_YSIZE*lcd.pixsize,heap,0);//先用一层
    if(0x3f&(u32)pLTDCBufferFG1)
        pLTDCBufferFG1+=(0x40-(0x3f&(u32)pLTDCBufferFG1));

    FrameBitmap.bm_bits=(u8 *)pLTDCBufferFG1;
    FrameBitmap.width = CFG_LCD_XSIZE;
    FrameBitmap.height = CFG_LCD_YSIZE;
    FrameBitmap.PixelFormat = lcd.LcdPixelFormat;
    FrameBitmap.linebytes = CFG_LCD_XSIZE*lcd.pixsize;
    FrameBitmap.ExColor = 0xffffffff;
    frame_win.wm_bitmap = &FrameBitmap;


    lcd_display.frame_buffer =&frame_win;
    lcd_display.framebuf_direct = true;

    lcd_display.width_um = CFG_LCD_XSIZE_UM;
    lcd_display.height_um = CFG_LCD_YSIZE_UM;
    lcd_display.width = CFG_LCD_XSIZE;
    lcd_display.height = CFG_LCD_YSIZE;
    lcd_display.pixel_format = lcd.LcdPixelFormat;

    lcd_display.draw.SetPixelToBitmap = __lcd_set_pixel_bm;
    lcd_display.draw.FillRectToBitmap = __lcd_fill_rect_bm;
    lcd_display.draw.LineToBitmap = __lcd_line_bm;
    lcd_display.draw.LineToBitmapIe = __lcd_line_bm_ie;
    lcd_display.draw.BltBitmapToBitmap = __lcd_blt_bm_to_bm;
    lcd_display.draw.SetPixelToScreen = __lcd_set_pixel_screen;
    lcd_display.draw.SetPixelGroupToScreen = __lcd_set_pixel_group_screen;
    lcd_display.draw.LineToScreen = __lcd_line_screen;
    lcd_display.draw.LineToScreenIe = __lcd_line_screen_ie;
    lcd_display.draw.FillRectToScreen = __lcd_fill_rect_screen;
    lcd_display.draw.CopyBitmapToScreen = __lcd_bm_to_screen;
    lcd_display.draw.GetPixelFromScreen = __lcd_get_pixel_screen;
    lcd_display.draw.GetRectFromScreen = __lcd_get_rect_screen;

    lcd_display.DisplayHeap =  heap;
    lcd_display.disp_ctrl = __lcd_disp_ctrl;

    Dma2d_Init();
    Lock_MutexCreate_s(&Dma2dMutex,"DMA2D");
    LTDC_Init(pLTDCBufferFG1);

    if(GK_InstallDisplay(&lcd_display,DisplayName))
        return &lcd_display;
    return NULL;
}



void DispMainInterface(unsigned char *pic)
{
    struct Rectangle dst_rect = {0,0,CFG_LCD_XSIZE,CFG_LCD_YSIZE};
    struct RectBitmap src_bitmap;

    src_bitmap.bm_bits = pic;
    src_bitmap.width = CFG_LCD_XSIZE;
    src_bitmap.height = CFG_LCD_YSIZE;
    src_bitmap.linebytes = CFG_LCD_XSIZE*2;
    src_bitmap.reversal = 0;
    src_bitmap.PixelFormat = CN_SYS_PF_RGB565;
    __lcd_bm_to_screen(&dst_rect,  &src_bitmap, 0, 0);
}






